Project/Toir/src/Reports/торо_ПрямыеЗатратыНаВыполнениеРемонтов/торо_ПрямыеЗатратыНаВыполнениеРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>торо_ПрямыеЗатратыНаВыполнениеРемонтов</name>
</mdclass:Report>

Project/Toir/src/InformationRegisters/торо_ПлановыеРемонтныеРаботы/торо_ПлановыеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПлановыеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_базы_расчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Замещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_замещающего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРасчетная</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПериодичностьДетализации</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_Ремонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>ГарантийныйРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_НормативныеРемонтыОборудования/торо_НормативныеРемонтыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НормативныеРемонтыОборудования</name>
  <resources>
    <name>НормативныйРемонт</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </resources>
  <resources>
    <name>СпособПланирования</name>
    <type>
      <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРемонтныхРабот</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьВПланированииДатуВводаВЭксплуатацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособУчетаДатыОтсчета</name>
    <type>
      <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
    <comment>Разрешить сокращать межремонтный период в случае, если начало ремонта приходится на выходной день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПродолжительность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьПростоиОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтратегияОбслуживания</name>
    <type>
      <types>CatalogRef.торо_СтратегииОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникСтратегии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ВерсииТехКарт/торо_ВерсииТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВерсииТехКарт</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТехКарта</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторТехКарты</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ПлановыеМероприятия/торо_ПлановыеМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПлановыеМероприятия</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_МаршрутыРегламентныхМероприятий/торо_МаршрутыРегламентныхМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_МаршрутыРегламентныхМероприятий</name>
  <resources>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_РегламентныеМероприятияИСпискиОбъектов/торо_РегламентныеМероприятияИСпискиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_РегламентныеМероприятияИСпискиОбъектов</name>
  <resources>
    <name>НормативныйРемонт</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </resources>
  <resources>
    <name>СпособПланирования</name>
    <type>
      <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРемонтныхРабот</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>СпособУчетаДатыОтсчета</name>
    <type>
      <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
    <comment>Разрешить сокращать период между ремонтами в случае, если начало ремонта приходится на выходной день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПродолжительность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Продолжительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаПродолжительности</name>
    <type>
      <types>EnumRef.торо_СпособыРасчетаПродолжительности</types>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_СоставИерархическихТехКартРемонтов/торо_СоставИерархическихТехКартРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СоставИерархическихТехКартРемонтов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТехКарта</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Состав</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/AccumulationRegisters/торо_ПлановыеМатериальныеЗатратыРемонтныхРабот/торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ПлановыеМатериальныеЗатратыРемонтныхРабот</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РемонтыОборудования_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РемонтнаяРабота</name>
    <type>
      <types>CatalogRef.торо_ТехнологическиеОперации</types>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/Reports/торо_ПрямыеЗатратыНаВыполнениеРемонтов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

Перем ИспользоватьРегламентныеМероприятия;
Перем ИспользоватьППР;                    
Перем ИспользоватьДефекты;               
Перем ИспользоватьВнешниеОснования;       
Перем ИспользоватьСметы;                  

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИерархияТип")).ИдентификаторПользовательскойНастройки;
	СтрокаПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
	
	Если СтрокаПараметр <> Неопределено И ЗначениеЗаполнено(СтрокаПараметр.Значение) Тогда
		ТекИерархия = СтрокаПараметр.Значение;
	Иначе
		ТекИерархия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяСтруктураИерархии",
			Справочники.торо_СтруктурыОР.ПустаяСсылка());
			
		Если СтрокаПараметр <> Неопределено Тогда
			СтрокаПараметр.Значение = ТекИерархия;
		КонецЕсли;
		
	КонецЕсли;
	
	торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "ДатаОкончания");
	
	Если ТекИерархия.СтроитсяАвтоматически Тогда
				
		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос =
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ
		|	ВТ_Данные.Объект КАК Объект,
		|	ВТ_Данные.ВидРемонта КАК ВидРемонта,
		|	ВТ_Данные.Приоритет КАК Приоритет,
		|	ВТ_Данные.ДатаРемонта КАК ДатаРемонта,
		|	ВТ_Данные.ВсегоСумма КАК ВсегоСумма,
		|	ВТ_Данные.ТрудозатратыСумма КАК ТрудозатратыСумма,
		|	ВТ_Данные.МатериальныеЗатратыСумма КАК МатериальныеЗатратыСумма,
		|	ВТ_Данные.ЗатратыЗапчастейСумма КАК ЗатратыЗапчастейСумма,
		|	ВТ_Данные.СпособВыполнения КАК СпособВыполнения,
		|	ВТ_Данные.ID КАК ID,
		|	ВТ_Данные.Регистратор КАК Регистратор,
		|	ВТ_Данные.Объект." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные";
	
		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);
		
	Иначе

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);

		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос = 
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ
		|	ВТ_Данные.Объект КАК Объект,
		|	ВТ_Данные.ВидРемонта КАК ВидРемонта,
		|	ВТ_Данные.Приоритет КАК Приоритет,
		|	ВТ_Данные.ДатаРемонта КАК ДатаРемонта,
		|	ВТ_Данные.ВсегоСумма КАК ВсегоСумма,
		|	ВТ_Данные.ТрудозатратыСумма КАК ТрудозатратыСумма,
		|	ВТ_Данные.МатериальныеЗатратыСумма КАК МатериальныеЗатратыСумма,
		|	ВТ_Данные.ЗатратыЗапчастейСумма КАК ЗатратыЗапчастейСумма,
		|	ВТ_Данные.СпособВыполнения КАК СпособВыполнения,
		|	ВТ_Данные.ID КАК ID,
		|	ВТ_Данные.Регистратор КАК Регистратор,
		|	ВТ_Данные.Объект КАК ОбъектИерархии
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ФункцииОтчетовКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПриЗагрузкеПользовательскихНастроекНаСервере = Истина;
	Настройки.События.ПриЗагрузкеВариантаНаСервере = Истина;
	Настройки.События.ПослеЗаполненияПанелиБыстрыхНастроек = Истина;
КонецПроцедуры

Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Форма, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ПользовательскиеНастройкиЭлементы = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы);
		
КонецПроцедуры

Процедура ПриЗагрузкеВариантаНаСервере(Форма, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ПользовательскиеНастройкиЭлементы = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;	
	ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы);
	
КонецПроцедуры

Процедура ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы)
	
	Для каждого Элемент Из ПользовательскиеНастройкиЭлементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если (Строка(Элемент.Параметр) = "УчитыватьППР"
				И Не ИспользоватьППР)Тогда
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь;
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				Продолжить;
			ИначеЕсли (Строка(Элемент.Параметр) = "УчитыватьРегламентныеМероприятия"
				И Не ИспользоватьРегламентныеМероприятия) Тогда 
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь;
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				Продолжить;
			ИначеЕсли (Строка(Элемент.Параметр) = "УчитыватьСметыПоДефектам"
				И (Не ИспользоватьДефекты
				ИЛИ Не ИспользоватьСметы) ) Тогда 
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь;
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				Продолжить;
			ИначеЕсли (Строка(Элемент.Параметр) = "УчитыватьСметыПоВнешнимОснованиям"
				И (Не ИспользоватьВнешниеОснования
				ИЛИ Не ИспользоватьСметы)) Тогда 
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь;
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла; 	
	
КонецПроцедуры


Процедура ПослеЗаполненияПанелиБыстрыхНастроек(Форма, ПараметрыЗаполнения) Экспорт
	
КонецПроцедуры

Функция ПолучитьЗначениеФО(НаименованиеФО) Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию(НаименованиеФО);
	
КонецФункции

Функция ПолучитьСодержательнуюЧастьЗапроса() 
	
	ЗапросТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПланГрафикРемонта.ОбъектРемонтныхРабот КАК Объект,
	|	торо_ПланГрафикРемонта.ОбъектРемонтныхРабот.ТиповойОР КАК ТиповойОР,
	|	торо_ПланГрафикРемонта.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ВЫБОР
	|		КОГДА торо_Ремонты.Регистратор ЕСТЬ NULL
	|			ТОГДА торо_ПланГрафикРемонта.ДатаНачалаРемонтныхРабот
	|		ИНАЧЕ торо_Ремонты.ДатаНачалаПлан
	|	КОНЕЦ КАК ДатаРемонта,
	|	ВЫБОР
	|		КОГДА торо_Ремонты.Регистратор ЕСТЬ NULL
	|			ТОГДА торо_ПланГрафикРемонта.ДатаОкончанияРемонтныхРабот
	|		ИНАЧЕ торо_Ремонты.ДатаОкончанияПлан
	|	КОНЕЦ КАК ДатаРемонтаКонец,
	|	торо_ПланГрафикРемонта.СпособВыполнения КАК СпособВыполнения,
	|	торо_ПланГрафикРемонта.ID КАК ID,
	|	торо_ПланГрафикРемонта.Регистратор КАК ДокППР,
	|	торо_Ремонты.Регистратор КАК Смета
	|ПОМЕСТИТЬ ТабИсхДанных
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних КАК торо_ПланГрафикРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
	|		ПО (ВЫБОР
	|				КОГДА &РассчетСметПоППР = ИСТИНА
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт)
	|			И торо_ПланГрафикРемонта.ID = торо_Ремонты.ID
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &РассчетППР = ИСТИНА
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И НЕ торо_ПланГрафикРемонта.Отменен
	|	И НЕ торо_ПланГрафикРемонта.Замещен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	торо_ПланГрафикРемонта.ОбъектРемонтныхРабот,
	|	ТиповойОР,
	|	торо_ПланГрафикРемонта.ВидРемонтныхРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_Ремонты.ДатаНачалаПлан КАК ДатаРемонта,
	|	торо_Ремонты.ОбъектРемонта КАК Объект,
	|	торо_Ремонты.ОбъектРемонта.ТиповойОР КАК ТиповойОР,
	|	торо_Ремонты.ВидРемонта КАК ВидРемонтныхРабот,
	|	торо_Ремонты.ДатаОкончанияПлан КАК ДатаОкончания,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ХозСпособ) КАК СпособВыполнения,
	|	торо_Ремонты.ID КАК ID,
	|	NULL КАК ДокППР,
	|	торо_ЗаявкаНаРемонтДокументыОснования.Ссылка КАК Смета
	|ПОМЕСТИТЬ СписокЗаявокНаОснованииДефектовИВнешнихОснований
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.ДокументыОснования КАК торо_ЗаявкаНаРемонтДокументыОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
	|		ПО торо_ЗаявкаНаРемонтДокументыОснования.Ссылка = торо_Ремонты.Регистратор
	|			И (ВЫБОР
	|					КОГДА &РассчетСметПоДефектам = ИСТИНА
	|						ТОГДА ТИПЗНАЧЕНИЯ(торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование) = ТИП(Документ.торо_ВыявленныеДефекты)
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|				ИЛИ ВЫБОР
	|					КОГДА &РассчетСметПоВнешнимОснованиям = ИСТИНА
	|						ТОГДА ТИПЗНАЧЕНИЯ(торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование) = ТИП(Документ.торо_ВнешнееОснованиеДляРабот)
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ)
	|{ГДЕ
	|	(торо_Ремонты.ДатаНачалаПлан <= &ДатаОкончания
	|			И торо_Ремонты.ДатаОкончанияПлан >= &ДатаНачала),
	|	(ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ХозСпособ) = &СпособВыполнения)}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабИсхДанных.Объект КАК Объект,
	|	ТабИсхДанных.ТиповойОР КАК ТиповойОР,
	|	ТабИсхДанных.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ТабИсхДанных.ДатаРемонта КАК ДатаРемонта,
	|	ТабИсхДанных.ДатаРемонтаКонец КАК ДатаРемонтаКонец,
	|	ТабИсхДанных.СпособВыполнения КАК СпособВыполнения,
	|	ТабИсхДанных.ID КАК ID,
	|	ТабИсхДанных.ДокППР КАК ДокППР,
	|	ТабИсхДанных.Смета КАК Смета
	|ПОМЕСТИТЬ ИсходныеДанныеСметы
	|ИЗ
	|	ТабИсхДанных КАК ТабИсхДанных
	|ГДЕ
	|	НЕ ТабИсхДанных.Смета ЕСТЬ NULL
	|{ГДЕ
	|	(ТабИсхДанных.ДатаРемонта МЕЖДУ &ДатаНачала И &ДатаОкончания),
	|	(ТабИсхДанных.СпособВыполнения = &СпособВыполнения)}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.Объект,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.ТиповойОР,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.ВидРемонтныхРабот,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.ДатаРемонта,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.ДатаОкончания,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.СпособВыполнения,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.ID,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.ДокППР,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.Смета
	|ИЗ
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований КАК СписокЗаявокНаОснованииДефектовИВнешнихОснований
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабИсхДанных.Объект КАК Объект,
	|	ТабИсхДанных.ТиповойОР КАК ТиповойОР,
	|	ТабИсхДанных.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ТабИсхДанных.ДатаРемонта КАК ДатаРемонта,
	|	ТабИсхДанных.ДатаРемонтаКонец КАК ДатаРемонтаКонец,
	|	ТабИсхДанных.СпособВыполнения КАК СпособВыполнения,
	|	ТабИсхДанных.ID КАК ID,
	|	ТабИсхДанных.ДокППР КАК ДокППР,
	|	ТабИсхДанных.Смета КАК Смета
	|ПОМЕСТИТЬ ТабИсходныхДанных
	|ИЗ
	|	ТабИсхДанных КАК ТабИсхДанных
	|ГДЕ
	|	ТабИсхДанных.Смета ЕСТЬ NULL
	|{ГДЕ
	|	(ТабИсхДанных.ДатаРемонта МЕЖДУ &ДатаНачала И &ДатаОкончания),
	|	(ТабИсхДанных.СпособВыполнения = &СпособВыполнения)}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТабИсходныхДанных.Объект КАК Объект,
	|	ТабИсходныхДанных.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_ВерсииТехКарт.ТехКарта КАК Ремонт
	|ПОМЕСТИТЬ ТабНормРемонтов
	|ИЗ
	|	ТабИсходныхДанных КАК ТабИсходныхДанных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
	|		ПО ТабИсходныхДанных.Объект = торо_НормативныеРемонтыОборудования.ОбъектРемонта
	|			И ТабИсходныхДанных.ВидРемонтныхРабот = торо_НормативныеРемонтыОборудования.ВидРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт.СрезПоследних КАК торо_ВерсииТехКарт
	|		ПО (торо_НормативныеРемонтыОборудования.НормативныйРемонт = торо_ВерсииТехКарт.ИдентификаторТехКарты)
	|ГДЕ
	|	торо_НормативныеРемонтыОборудования.Приоритет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТабИсходныхДанных.Объект,
	|	ТабИсходныхДанных.ВидРемонтныхРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабИсходныхДанных.Объект КАК Объект,
	|	ТабИсходныхДанных.ТиповойОР КАК ТиповойОР,
	|	ТабИсходныхДанных.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ТабИсходныхДанных.ДатаРемонта КАК ДатаРемонта,
	|	ТабИсходныхДанных.ДатаРемонтаКонец КАК ДатаРемонтаКонец,
	|	ТабИсходныхДанных.СпособВыполнения КАК СпособВыполнения,
	|	ТабИсходныхДанных.ID КАК ID,
	|	ТабНормРемонтов.Ремонт КАК Ремонт,
	|	ТабИсходныхДанных.ДокППР КАК Регистратор
	|ПОМЕСТИТЬ РемонтыПГР
	|ИЗ
	|	ТабИсходныхДанных КАК ТабИсходныхДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабНормРемонтов КАК ТабНормРемонтов
	|		ПО ТабИсходныхДанных.Объект = ТабНормРемонтов.Объект
	|			И ТабИсходныхДанных.ВидРемонтныхРабот = ТабНормРемонтов.ВидРемонтныхРабот
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта,
	|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта.ТиповойОР,
	|	торо_ПлановыеМероприятия.ВидМероприятия,
	|	торо_ПлановыеМероприятия.ДатаНачала,
	|	торо_ПлановыеМероприятия.ДатаОкончания,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ХозСпособ),
	|	торо_ПлановыеМероприятия.ID,
	|	торо_ВерсииТехКарт.ТехКарта,
	|	торо_ПлановыеМероприятия.Регистратор
	|ИЗ
	|	РегистрСведений.торо_ПлановыеМероприятия.СрезПоследних(, ) КАК торо_ПлановыеМероприятия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
	|		ПО торо_ПлановыеМероприятия.СписокОбъектов = торо_МаршрутыРегламентныхМероприятий.СписокОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РегламентныеМероприятияИСпискиОбъектов КАК торо_РегламентныеМероприятияИСпискиОбъектов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт.СрезПоследних КАК торо_ВерсииТехКарт
	|			ПО (торо_ВерсииТехКарт.ИдентификаторТехКарты = торо_РегламентныеМероприятияИСпискиОбъектов.НормативныйРемонт)
	|		ПО торо_ПлановыеМероприятия.СписокОбъектов = торо_РегламентныеМероприятияИСпискиОбъектов.СписокОбъектов
	|			И торо_ПлановыеМероприятия.ВидМероприятия = торо_РегламентныеМероприятияИСпискиОбъектов.ВидМероприятия
	|ГДЕ
	|	НЕ торо_ПлановыеМероприятия.Отменен
	|	И ВЫБОР
	|			КОГДА &РассчетРеглМероприятий
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|{ГДЕ
	|	(торо_ПлановыеМероприятия.ДатаНачала <= &ДатаОкончания
	|			И торо_ПлановыеМероприятия.ДатаНачала >= &ДатаНачала),
	|	(ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ХозСпособ) = &СпособВыполнения)}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РемонтыПГР.Объект КАК Объект,
	|	РемонтыПГР.ТиповойОР КАК ТиповойОР,
	|	РемонтыПГР.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	РемонтыПГР.ДатаРемонта КАК ДатаРемонта,
	|	РемонтыПГР.ДатаРемонтаКонец КАК ДатаРемонтаКонец,
	|	РемонтыПГР.СпособВыполнения КАК СпособВыполнения,
	|	РемонтыПГР.ID КАК ID,
	|	РемонтыПГР.Ремонт КАК Ремонт,
	|	торо_Состав.Состав КАК ТехКарта,
	|	торо_Состав.Количество КАК Количество,
	|	РемонтыПГР.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ РемонтыПГР_техкарты
	|ИЗ
	|	РемонтыПГР КАК РемонтыПГР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СоставИерархическихТехКартРемонтов КАК торо_Состав
	|		ПО РемонтыПГР.Ремонт = торо_Состав.ТехКарта
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РемонтыПГР.Объект,
	|	РемонтыПГР.ТиповойОР,
	|	РемонтыПГР.ВидРемонтныхРабот,
	|	РемонтыПГР.ДатаРемонта,
	|	РемонтыПГР.ДатаРемонтаКонец,
	|	РемонтыПГР.СпособВыполнения,
	|	РемонтыПГР.ID,
	|	РемонтыПГР.Ремонт,
	|	РемонтыПГР.Ремонт,
	|	1,
	|	РемонтыПГР.Регистратор
	|ИЗ
	|	РемонтыПГР КАК РемонтыПГР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РемонтыПГР.ID КАК ID,
	|	РемонтыПГР.Ремонт КАК Ремонт,
	|	ВЫБОР
	|		КОГДА торо_ТехКартыМатериальныеЗатраты.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА торо_ТехКартыМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ торо_ТехКартыМатериальныеЗатраты.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	СУММА(ЕСТЬNULL(торо_ТехКартыМатериальныеЗатраты.Количество, 0) * РемонтыПГР.Количество) КАК Количество,
	|	торо_ТехКартыМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	|	торо_ТехКартыМатериальныеЗатраты.Характеристика КАК Характеристика,
	|	РемонтыПГР.ДатаРемонта КАК ДатаРемонта,
	|	Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта КАК ТипЦены,
	|	РемонтыПГР.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ МатериальныеЗатратыПоРемонту
	|ИЗ
	|	РемонтыПГР_техкарты КАК РемонтыПГР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.МатериальныеЗатраты КАК торо_ТехКартыМатериальныеЗатраты
	|		ПО РемонтыПГР.ТехКарта = торо_ТехКартыМатериальныеЗатраты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	РемонтыПГР.ID,
	|	РемонтыПГР.Ремонт,
	|	торо_ТехКартыМатериальныеЗатраты.ЕдиницаИзмерения,
	|	торо_ТехКартыМатериальныеЗатраты.Номенклатура,
	|	торо_ТехКартыМатериальныеЗатраты.Характеристика,
	|	РемонтыПГР.ДатаРемонта,
	|	Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта,
	|	РемонтыПГР.Регистратор,
	|	ВЫБОР
	|		КОГДА торо_ТехКартыМатериальныеЗатраты.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА торо_ТехКартыМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ торо_ТехКартыМатериальныеЗатраты.ЕдиницаИзмерения
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсходныеДанныеСметы.ID,
	|	NULL,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Номенклатура.ЕдиницаИзмерения,
	|	СУММА(ЕСТЬNULL(торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Количество, 0)),
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Номенклатура,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.ХарактеристикаНоменклатуры,
	|	ИсходныеДанныеСметы.ДатаРемонта,
	|	Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Регистратор
	|ИЗ
	|	ИсходныеДанныеСметы КАК ИсходныеДанныеСметы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ПлановыеМатериальныеЗатратыРемонтныхРабот КАК торо_ПлановыеМатериальныеЗатратыРемонтныхРабот
	|		ПО ИсходныеДанныеСметы.ID = торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.РемонтыОборудования_ID
	|			И ИсходныеДанныеСметы.Смета = торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Регистратор,
	|	Константы КАК Константы
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсходныеДанныеСметы.ID,
	|	ИсходныеДанныеСметы.ДатаРемонта,
	|	Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Номенклатура,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.ХарактеристикаНоменклатуры,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Номенклатура.ЕдиницаИзмерения,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РемонтыПГР.ID КАК ID,
	|	РемонтыПГР.ДатаРемонта КАК ДатаРемонта,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура КАК Номенклатура,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Характеристика КАК Характеристика,
	|	СУММА(ЕСТЬNULL(торо_НормыЗапчастейНаОбъектыРемонта.Количество, 0)) КАК Количество,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта КАК ТипЦены,
	|	РемонтыПГР.ВидРемонтныхРабот КАК Ремонт,
	|	РемонтыПГР.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ЗатратыНаЗапчастиПоРемонту
	|ИЗ
	|	РемонтыПГР КАК РемонтыПГР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормыЗапчастейНаОбъектыРемонта КАК торо_НормыЗапчастейНаОбъектыРемонта
	|		ПО РемонтыПГР.ВидРемонтныхРабот = торо_НормыЗапчастейНаОбъектыРемонта.ВидРемонта
	|			И РемонтыПГР.Объект = торо_НормыЗапчастейНаОбъектыРемонта.ОбъектРемонта
	|			И (торо_НормыЗапчастейНаОбъектыРемонта.Приоритет)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	РемонтыПГР.ID,
	|	РемонтыПГР.ДатаРемонта,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Характеристика,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура.ЕдиницаИзмерения,
	|	Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта,
	|	РемонтыПГР.ВидРемонтныхРабот,
	|	торо_НормыЗапчастейНаОбъектыРемонта.ОбъектРемонта,
	|	РемонтыПГР.Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсходныеДанныеСметы.ID,
	|	ИсходныеДанныеСметы.ДатаРемонта,
	|	торо_ПлановыеЗатратыЗапчастей.Номенклатура,
	|	торо_ПлановыеЗатратыЗапчастей.ХарактеристикаНоменклатуры,
	|	СУММА(ЕСТЬNULL(торо_ПлановыеЗатратыЗапчастей.Количество, 0)),
	|	торо_ПлановыеЗатратыЗапчастей.Номенклатура.ЕдиницаИзмерения,
	|	Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта,
	|	ИсходныеДанныеСметы.ВидРемонтныхРабот,
	|	торо_ПлановыеЗатратыЗапчастей.Регистратор
	|ИЗ
	|	ИсходныеДанныеСметы КАК ИсходныеДанныеСметы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ПлановыеЗатратыЗапчастей КАК торо_ПлановыеЗатратыЗапчастей
	|		ПО ИсходныеДанныеСметы.ID = торо_ПлановыеЗатратыЗапчастей.РемонтыОборудования_ID
	|			И ИсходныеДанныеСметы.Смета = торо_ПлановыеЗатратыЗапчастей.Регистратор,
	|	Константы КАК Константы
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсходныеДанныеСметы.ID,
	|	ИсходныеДанныеСметы.ДатаРемонта,
	|	Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта,
	|	ИсходныеДанныеСметы.ВидРемонтныхРабот,
	|	торо_ПлановыеЗатратыЗапчастей.Номенклатура,
	|	торо_ПлановыеЗатратыЗапчастей.ХарактеристикаНоменклатуры,
	|	торо_ПлановыеЗатратыЗапчастей.Номенклатура.ЕдиницаИзмерения,
	|	торо_ПлановыеЗатратыЗапчастей.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МатериальныеЗатратыПоРемонту.ID КАК ID,
	|	МатериальныеЗатратыПоРемонту.ДатаРемонта КАК ДатаРемонта,
	|	МатериальныеЗатратыПоРемонту.Номенклатура КАК Номенклатура,
	|	МатериальныеЗатратыПоРемонту.Характеристика КАК Характеристика,
	|	МатериальныеЗатратыПоРемонту.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	МатериальныеЗатратыПоРемонту.ТипЦены КАК ТипЦены,
	|	МатериальныеЗатратыПоРемонту.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|	МатериальныеЗатратыПоРемонту КАК МатериальныеЗатратыПоРемонту
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗатратыНаЗапчастиПоРемонту.ID,
	|	ЗатратыНаЗапчастиПоРемонту.ДатаРемонта,
	|	ЗатратыНаЗапчастиПоРемонту.Номенклатура,
	|	ЗатратыНаЗапчастиПоРемонту.Характеристика,
	|	ЗатратыНаЗапчастиПоРемонту.ЕдиницаИзмерения,
	|	ЗатратыНаЗапчастиПоРемонту.ТипЦены,
	|	NULL
	|ИЗ
	|	ЗатратыНаЗапчастиПоРемонту КАК ЗатратыНаЗапчастиПоРемонту
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаНоменклатуры.ID КАК ID,
	|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТаблицаНоменклатуры.Характеристика КАК Характеристика,
	|	ТаблицаНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаНоменклатуры.ДатаРемонта КАК ДатаРемонта,
	|	МАКСИМУМ(ЦеныНоменклатуры.Период) КАК ДатаРегистр,
	|	ТаблицаНоменклатуры.ТипЦены КАК ТипЦены
	|ПОМЕСТИТЬ ДатаРегистраЦены
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ТаблицаНоменклатуры.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И ТаблицаНоменклатуры.Характеристика = ЦеныНоменклатуры.Характеристика
	|			И ТаблицаНоменклатуры.ДатаРемонта >= ЦеныНоменклатуры.Период
	|			И ТаблицаНоменклатуры.ТипЦены = ЦеныНоменклатуры.ВидЦены
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНоменклатуры.ID,
	|	ТаблицаНоменклатуры.Номенклатура,
	|	ТаблицаНоменклатуры.Характеристика,
	|	ТаблицаНоменклатуры.ЕдиницаИзмерения,
	|	ТаблицаНоменклатуры.ДатаРемонта,
	|	ТаблицаНоменклатуры.ТипЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатаРегистраЦены.ID КАК ID,
	|	ДатаРегистраЦены.ДатаРемонта КАК ДатаРемонта,
	|	ДатаРегистраЦены.Номенклатура КАК Номенклатура,
	|	ДатаРегистраЦены.Характеристика КАК Характеристика,
	|	ДатаРегистраЦены.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Цена,
	|	ЦеныНоменклатуры.Валюта КАК Валюта
	|ПОМЕСТИТЬ ЦенаНоменклатуры
	|ИЗ
	|	ДатаРегистраЦены КАК ДатаРегистраЦены
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ДатаРегистраЦены.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И ДатаРегистраЦены.Характеристика = ЦеныНоменклатуры.Характеристика
	|			И ДатаРегистраЦены.ЕдиницаИзмерения = ЦеныНоменклатуры.ЕдиницаИзмерения
	|			И ДатаРегистраЦены.ТипЦены = ЦеныНоменклатуры.ВидЦены
	|			И ДатаРегистраЦены.ДатаРегистр = ЦеныНоменклатуры.Период,
	|	Константы КАК Константы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РемонтыПГР.ID КАК ID,
	|	РемонтыПГР.Ремонт КАК Ремонт,
	|	РемонтыПГР.ДатаРемонта КАК ДатаРемонта,
	|	РемонтыПГР.ДатаРемонтаКонец КАК ДатаРемонтаКонец,
	|	РемонтыПГР.ТехКарта КАК ТехКарта,
	|	РемонтыПГР.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ СписокРемонтовПГР
	|ИЗ
	|	РемонтыПГР_техкарты КАК РемонтыПГР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(торо_ТехКартыСписокОпераций.Операция.Расценка * торо_ТехКартыСписокОпераций.Количество) КАК Сумма,
	|	торо_ТехКартыСписокОпераций.Операция.Валюта КАК Валюта,
	|	СписокРемонтовПГР.ДатаРемонта КАК ДатаРемонта,
	|	СписокРемонтовПГР.Ремонт КАК Ремонт,
	|	СписокРемонтовПГР.ID КАК ID,
	|	СписокРемонтовПГР.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ПоТехОперациямСуммаВвалюте
	|ИЗ
	|	СписокРемонтовПГР КАК СписокРемонтовПГР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКартыСписокОпераций
	|		ПО СписокРемонтовПГР.ТехКарта = торо_ТехКартыСписокОпераций.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокРемонтовПГР.ID,
	|	СписокРемонтовПГР.Ремонт,
	|	СписокРемонтовПГР.ДатаРемонта,
	|	торо_ТехКартыСписокОпераций.Операция.Валюта,
	|	СписокРемонтовПГР.Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота.Расценка * торо_ЗаявкаНаРемонтРемонтныеРаботы.Количество),
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота.Валюта,
	|	ИсходныеДанныеСметы.ДатаРемонта,
	|	NULL,
	|	ИсходныеДанныеСметы.ID,
	|	ИсходныеДанныеСметы.Смета
	|ИЗ
	|	ИсходныеДанныеСметы КАК ИсходныеДанныеСметы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
	|		ПО ИсходныеДанныеСметы.ID = торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID
	|			И ИсходныеДанныеСметы.Смета = торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка
	|ГДЕ
	|	ВЫРАЗИТЬ(торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота КАК Справочник.торо_ТехнологическиеОперации) ССЫЛКА Справочник.торо_ТехнологическиеОперации
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота.Валюта,
	|	ИсходныеДанныеСметы.ДатаРемонта,
	|	ИсходныеДанныеСметы.ID,
	|	ИсходныеДанныеСметы.Смета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаРемРабот.ДатаРемонтаКонец КАК ДатаРемонтаКонец,
	|	Квалификации.Период КАК Период,
	|	Квалификации.Стоимость КАК Стоимость,
	|	Квалификации.Валюта КАК Валюта,
	|	Квалификации.Квалификация КАК Квалификация,
	|	ТаблицаРемРабот.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ТабДатКвалификаций
	|ИЗ
	|	СписокРемонтовПГР КАК ТаблицаРемРабот
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтоимостьЧасаКвалификации КАК Квалификации
	|		ПО (Квалификации.Период <= ТаблицаРемРабот.ДатаРемонтаКонец)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсходныеДанныеСметы.ДатаРемонтаКонец,
	|	торо_СтоимостьЧасаКвалификации.Период,
	|	торо_СтоимостьЧасаКвалификации.Стоимость,
	|	торо_СтоимостьЧасаКвалификации.Валюта,
	|	торо_СтоимостьЧасаКвалификации.Квалификация,
	|	ИсходныеДанныеСметы.Смета
	|ИЗ
	|	ИсходныеДанныеСметы КАК ИсходныеДанныеСметы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтоимостьЧасаКвалификации КАК торо_СтоимостьЧасаКвалификации
	|		ПО (торо_СтоимостьЧасаКвалификации.Период <= ИсходныеДанныеСметы.ДатаРемонтаКонец)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабДатКвалификаций.ДатаРемонтаКонец КАК ДатаРемонтаКонец,
	|	ТабДатКвалификаций.Квалификация КАК Квалификация,
	|	МАКСИМУМ(ТабДатКвалификаций.Период) КАК Период
	|ПОМЕСТИТЬ ТабМаксДатКвалификаций
	|ИЗ
	|	ТабДатКвалификаций КАК ТабДатКвалификаций
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабДатКвалификаций.ДатаРемонтаКонец,
	|	ТабДатКвалификаций.Квалификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТабДатКвалификаций.ДатаРемонтаКонец КАК ДатаРемонтаКонец,
	|	ТабДатКвалификаций.Валюта КАК Валюта,
	|	ТабДатКвалификаций.Стоимость КАК Стоимость,
	|	ТабДатКвалификаций.Квалификация КАК Квалификация,
	|	ТабДатКвалификаций.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ТабСтоимостейКвалификаций
	|ИЗ
	|	ТабДатКвалификаций КАК ТабДатКвалификаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабМаксДатКвалификаций КАК ТабМаксДатКвалификаций
	|		ПО ТабДатКвалификаций.ДатаРемонтаКонец = ТабМаксДатКвалификаций.ДатаРемонтаКонец
	|			И ТабДатКвалификаций.Период = ТабМаксДатКвалификаций.Период
	|			И ТабДатКвалификаций.Квалификация = ТабМаксДатКвалификаций.Квалификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ТехКартыТрудовыеЗатраты.Ссылка КАК Ссылка,
	|	торо_ТехКартыТрудовыеЗатраты.Квалификация КАК Квалификация,
	|	ТабСтоимостейКвалификаций.Стоимость КАК СтоимостьНормочаса,
	|	ТабСтоимостейКвалификаций.Валюта КАК Валюта,
	|	ТабСтоимостейКвалификаций.ДатаРемонтаКонец КАК ДатаРемонтаКонец,
	|	торо_ТехКартыТрудовыеЗатраты.Количество КАК Количество,
	|	торо_ТехКартыТрудовыеЗатраты.ВремяРаботы КАК ВремяРаботы,
	|	NULL КАК ID,
	|	ТабСтоимостейКвалификаций.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ РемонтыТрудовыеЗатраты
	|ИЗ
	|	Справочник.торо_ТехКарты.ТрудовыеЗатраты КАК торо_ТехКартыТрудовыеЗатраты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабСтоимостейКвалификаций КАК ТабСтоимостейКвалификаций
	|		ПО торо_ТехКартыТрудовыеЗатраты.Квалификация = ТабСтоимостейКвалификаций.Квалификация
	|ГДЕ
	|	торо_ТехКартыТрудовыеЗатраты.Ссылка В
	|			(ВЫБРАТЬ
	|				СписокРемонтовПГР.ТехКарта
	|			ИЗ
	|				СписокРемонтовПГР КАК СписокРемонтовПГР)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.Квалификация,
	|	ТабСтоимостейКвалификаций.Стоимость,
	|	ТабСтоимостейКвалификаций.Валюта,
	|	ТабСтоимостейКвалификаций.ДатаРемонтаКонец,
	|	торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.Количество,
	|	торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.ВремяРаботы,
	|	ИсходныеДанныеСметы.ID,
	|	ТабСтоимостейКвалификаций.Регистратор
	|ИЗ
	|	ИсходныеДанныеСметы КАК ИсходныеДанныеСметы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ПлановыеТрудовыеЗатратыРемонтныхРабот КАК торо_ПлановыеТрудовыеЗатратыРемонтныхРабот
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабСтоимостейКвалификаций КАК ТабСтоимостейКвалификаций
	|			ПО торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.Квалификация = ТабСтоимостейКвалификаций.Квалификация
	|		ПО ИсходныеДанныеСметы.ID = торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.РемонтыОборудования_ID
	|			И ИсходныеДанныеСметы.Смета = торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(торо_РемонтыТрудовыеЗатраты.СтоимостьНормочаса * торо_РемонтыТрудовыеЗатраты.Количество * торо_РемонтыТрудовыеЗатраты.ВремяРаботы / 3600) КАК Сумма,
	|	торо_РемонтыТрудовыеЗатраты.Валюта КАК Валюта,
	|	СписокРемонтовПГР.ДатаРемонта КАК ДатаРемонта,
	|	СписокРемонтовПГР.Ремонт КАК Ремонт,
	|	СписокРемонтовПГР.ID КАК ID,
	|	СписокРемонтовПГР.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ТрудозатратыСуммаПоКвалификациямВВалюте
	|ИЗ
	|	СписокРемонтовПГР КАК СписокРемонтовПГР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РемонтыТрудовыеЗатраты КАК торо_РемонтыТрудовыеЗатраты
	|		ПО СписокРемонтовПГР.ТехКарта = торо_РемонтыТрудовыеЗатраты.Ссылка
	|			И СписокРемонтовПГР.ДатаРемонтаКонец = торо_РемонтыТрудовыеЗатраты.ДатаРемонтаКонец
	|			И СписокРемонтовПГР.Регистратор = торо_РемонтыТрудовыеЗатраты.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокРемонтовПГР.ID,
	|	СписокРемонтовПГР.Ремонт,
	|	СписокРемонтовПГР.ДатаРемонта,
	|	торо_РемонтыТрудовыеЗатраты.Валюта,
	|	СписокРемонтовПГР.Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(торо_РемонтыТрудовыеЗатраты.СтоимостьНормочаса * торо_РемонтыТрудовыеЗатраты.Количество * торо_РемонтыТрудовыеЗатраты.ВремяРаботы / 3600),
	|	торо_РемонтыТрудовыеЗатраты.Валюта,
	|	ИсходныеДанныеСметы.ДатаРемонта,
	|	NULL,
	|	ИсходныеДанныеСметы.ID,
	|	ИсходныеДанныеСметы.Смета
	|ИЗ
	|	ИсходныеДанныеСметы КАК ИсходныеДанныеСметы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РемонтыТрудовыеЗатраты КАК торо_РемонтыТрудовыеЗатраты
	|		ПО ИсходныеДанныеСметы.ID = торо_РемонтыТрудовыеЗатраты.ID
	|			И ИсходныеДанныеСметы.ДатаРемонтаКонец = торо_РемонтыТрудовыеЗатраты.ДатаРемонтаКонец
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсходныеДанныеСметы.ID,
	|	ИсходныеДанныеСметы.ДатаРемонта,
	|	торо_РемонтыТрудовыеЗатраты.Валюта,
	|	ИсходныеДанныеСметы.Смета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТрудозатратыСуммаПоКвалификациямВВалюте.Валюта КАК Валюта,
	|	ТрудозатратыСуммаПоКвалификациямВВалюте.ДатаРемонта КАК ДатаРемонта,
	|	ТрудозатратыСуммаПоКвалификациямВВалюте.ID КАК ID
	|ПОМЕСТИТЬ ДанныеВалюта
	|ИЗ
	|	ТрудозатратыСуммаПоКвалификациямВВалюте КАК ТрудозатратыСуммаПоКвалификациямВВалюте
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоТехОперациямСуммаВвалюте.Валюта,
	|	ПоТехОперациямСуммаВвалюте.ДатаРемонта,
	|	ПоТехОперациямСуммаВвалюте.ID
	|ИЗ
	|	ПоТехОперациямСуммаВвалюте КАК ПоТехОперациямСуммаВвалюте
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦенаНоменклатуры.Валюта,
	|	ЦенаНоменклатуры.ДатаРемонта,
	|	ЦенаНоменклатуры.ID
	|ИЗ
	|	ЦенаНоменклатуры КАК ЦенаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеВалюта.Валюта КАК Валюта,
	|	МАКСИМУМ(КурсыВалют.Период) КАК ДатаРегистр,
	|	ДанныеВалюта.ДатаРемонта КАК ДатаРемонта,
	|	ДанныеВалюта.ID КАК ID
	|ПОМЕСТИТЬ ДатаРегистраКурсов
	|ИЗ
	|	ДанныеВалюта КАК ДанныеВалюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ДанныеВалюта.Валюта = КурсыВалют.Валюта
	|			И ДанныеВалюта.ДатаРемонта >= КурсыВалют.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеВалюта.ID,
	|	ДанныеВалюта.Валюта,
	|	ДанныеВалюта.ДатаРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатаРегистраКурсов.ID КАК ID,
	|	ДатаРегистраКурсов.ДатаРемонта КАК ДатаРемонта,
	|	ДатаРегистраКурсов.Валюта КАК Валюта,
	|	ЕСТЬNULL(КурсыВалют.Курс, 0) КАК Курс,
	|	ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК Кратность
	|ПОМЕСТИТЬ ТабКурсыВалют
	|ИЗ
	|	ДатаРегистраКурсов КАК ДатаРегистраКурсов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ДатаРегистраКурсов.Валюта = КурсыВалют.Валюта
	|			И ДатаРегистраКурсов.ДатаРегистр = КурсыВалют.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МатериальныеЗатратыПоРемонту.ID КАК ID,
	|	МатериальныеЗатратыПоРемонту.Ремонт КАК Ремонт,
	|	МатериальныеЗатратыПоРемонту.ДатаРемонта КАК ДатаРемонта,
	|	СУММА(ЦенаНоменклатуры.Цена * МатериальныеЗатратыПоРемонту.Количество * ТабКурсыВалют.Курс / ТабКурсыВалют.Кратность) КАК Сумма,
	|	МатериальныеЗатратыПоРемонту.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ МатериальныеЗатратыСумма
	|ИЗ
	|	МатериальныеЗатратыПоРемонту КАК МатериальныеЗатратыПоРемонту
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенаНоменклатуры КАК ЦенаНоменклатуры
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТабКурсыВалют КАК ТабКурсыВалют
	|			ПО ЦенаНоменклатуры.ID = ТабКурсыВалют.ID
	|				И ЦенаНоменклатуры.ДатаРемонта = ТабКурсыВалют.ДатаРемонта
	|				И ЦенаНоменклатуры.Валюта = ТабКурсыВалют.Валюта
	|		ПО МатериальныеЗатратыПоРемонту.ЕдиницаИзмерения = ЦенаНоменклатуры.ЕдиницаИзмерения
	|			И МатериальныеЗатратыПоРемонту.ID = ЦенаНоменклатуры.ID
	|			И МатериальныеЗатратыПоРемонту.Номенклатура = ЦенаНоменклатуры.Номенклатура
	|			И МатериальныеЗатратыПоРемонту.Характеристика = ЦенаНоменклатуры.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	МатериальныеЗатратыПоРемонту.ID,
	|	МатериальныеЗатратыПоРемонту.Ремонт,
	|	МатериальныеЗатратыПоРемонту.ДатаРемонта,
	|	МатериальныеЗатратыПоРемонту.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗатратыНаЗапчастиПоРемонту.ID КАК ID,
	|	ЗатратыНаЗапчастиПоРемонту.ДатаРемонта КАК ДатаРемонта,
	|	СУММА(ЦенаНоменклатуры.Цена * ЗатратыНаЗапчастиПоРемонту.Количество * ТабКурсыВалют.Курс / ТабКурсыВалют.Кратность) КАК Сумма,
	|	ЗатратыНаЗапчастиПоРемонту.Ремонт КАК Ремонт,
	|	ЗатратыНаЗапчастиПоРемонту.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ЗапчастиЗатратыСумма
	|ИЗ
	|	ЗатратыНаЗапчастиПоРемонту КАК ЗатратыНаЗапчастиПоРемонту
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенаНоменклатуры КАК ЦенаНоменклатуры
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабКурсыВалют КАК ТабКурсыВалют
	|			ПО ЦенаНоменклатуры.ID = ТабКурсыВалют.ID
	|				И ЦенаНоменклатуры.ДатаРемонта = ТабКурсыВалют.ДатаРемонта
	|				И ЦенаНоменклатуры.ДатаРемонта = ТабКурсыВалют.ДатаРемонта
	|				И ЦенаНоменклатуры.Валюта = ТабКурсыВалют.Валюта
	|		ПО ЗатратыНаЗапчастиПоРемонту.Номенклатура = ЦенаНоменклатуры.Номенклатура
	|			И ЗатратыНаЗапчастиПоРемонту.Характеристика = ЦенаНоменклатуры.Характеристика
	|			И ЗатратыНаЗапчастиПоРемонту.ЕдиницаИзмерения = ЦенаНоменклатуры.ЕдиницаИзмерения
	|			И ЗатратыНаЗапчастиПоРемонту.ID = ЦенаНоменклатуры.ID
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗатратыНаЗапчастиПоРемонту.ID,
	|	ЗатратыНаЗапчастиПоРемонту.ДатаРемонта,
	|	ЗатратыНаЗапчастиПоРемонту.Ремонт,
	|	ЗатратыНаЗапчастиПоРемонту.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ПоТехОперациямСуммаВвалюте.Сумма * ТабКурсыВалют.Курс / ТабКурсыВалют.Кратность) КАК Сумма,
	|	ПоТехОперациямСуммаВвалюте.Ремонт КАК Ремонт,
	|	ПоТехОперациямСуммаВвалюте.ДатаРемонта КАК ДатаРемонта,
	|	ПоТехОперациямСуммаВвалюте.ID КАК ID
	|ПОМЕСТИТЬ ПоТехОперациямСумма
	|ИЗ
	|	ПоТехОперациямСуммаВвалюте КАК ПоТехОперациямСуммаВвалюте
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабКурсыВалют КАК ТабКурсыВалют
	|		ПО (ТабКурсыВалют.ДатаРемонта = ПоТехОперациямСуммаВвалюте.ДатаРемонта)
	|			И (ТабКурсыВалют.ID = ПоТехОперациямСуммаВвалюте.ID)
	|			И ПоТехОперациямСуммаВвалюте.Валюта = ТабКурсыВалют.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоТехОперациямСуммаВвалюте.ID,
	|	ПоТехОперациямСуммаВвалюте.Ремонт,
	|	ПоТехОперациямСуммаВвалюте.ДатаРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ТрудозатратыСуммаПоКвалификациямВВалюте.Сумма * ТабКурсыВалют.Курс / ТабКурсыВалют.Кратность) КАК Сумма,
	|	ТрудозатратыСуммаПоКвалификациямВВалюте.Ремонт КАК Ремонт,
	|	ТрудозатратыСуммаПоКвалификациямВВалюте.ДатаРемонта КАК ДатаРемонта,
	|	ТрудозатратыСуммаПоКвалификациямВВалюте.ID КАК ID,
	|	ТрудозатратыСуммаПоКвалификациямВВалюте.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ТрудозатратыСуммаПоКвалификациям
	|ИЗ
	|	ТрудозатратыСуммаПоКвалификациямВВалюте КАК ТрудозатратыСуммаПоКвалификациямВВалюте
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабКурсыВалют КАК ТабКурсыВалют
	|		ПО (ТабКурсыВалют.ID = ТрудозатратыСуммаПоКвалификациямВВалюте.ID)
	|			И (ТабКурсыВалют.Валюта = ТрудозатратыСуммаПоКвалификациямВВалюте.Валюта)
	|			И ТрудозатратыСуммаПоКвалификациямВВалюте.Валюта = ТабКурсыВалют.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	ТрудозатратыСуммаПоКвалификациямВВалюте.Ремонт,
	|	ТрудозатратыСуммаПоКвалификациямВВалюте.ДатаРемонта,
	|	ТрудозатратыСуммаПоКвалификациямВВалюте.ID,
	|	ТрудозатратыСуммаПоКвалификациямВВалюте.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РемонтыПГР.Объект КАК Объект,
	|	РемонтыПГР.ВидРемонтныхРабот КАК ВидРемонта,
	|	торо_ОбъектыРемонта.Приоритет КАК Приоритет,
	|	РемонтыПГР.ДатаРемонта КАК ДатаРемонта,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА &РасчётТрудозатрат = ""Квалификация""
	|				ТОГДА ЕСТЬNULL(ТрудозатратыСуммаПоКвалификациям.Сумма, 0)
	|			ИНАЧЕ ЕСТЬNULL(ПоТехОперациямСумма.Сумма, 0)
	|		КОНЕЦ + ЕСТЬNULL(МатериальныеЗатратыСумма.Сумма, 0) + ЕСТЬNULL(ЗапчастиЗатратыСумма.Сумма, 0) КАК ЧИСЛО(15, 2)) КАК ВсегоСумма,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА &РасчётТрудозатрат = ""Квалификация""
	|				ТОГДА ТрудозатратыСуммаПоКвалификациям.Сумма
	|			ИНАЧЕ ПоТехОперациямСумма.Сумма
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ТрудозатратыСумма,
	|	МатериальныеЗатратыСумма.Сумма КАК МатериальныеЗатратыСумма,
	|	ЗапчастиЗатратыСумма.Сумма КАК ЗатратыЗапчастейСумма,
	|	РемонтыПГР.СпособВыполнения КАК СпособВыполнения,
	|	РемонтыПГР.ID КАК ID,
	|	РемонтыПГР.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РемонтыПГР КАК РемонтыПГР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ПО РемонтыПГР.Объект = торо_ОбъектыРемонта.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТрудозатратыСуммаПоКвалификациям КАК ТрудозатратыСуммаПоКвалификациям
	|		ПО РемонтыПГР.Ремонт = ТрудозатратыСуммаПоКвалификациям.Ремонт
	|			И РемонтыПГР.ID = ТрудозатратыСуммаПоКвалификациям.ID
	|			И РемонтыПГР.Регистратор = ТрудозатратыСуммаПоКвалификациям.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ МатериальныеЗатратыСумма КАК МатериальныеЗатратыСумма
	|		ПО РемонтыПГР.Ремонт = МатериальныеЗатратыСумма.Ремонт
	|			И РемонтыПГР.ID = МатериальныеЗатратыСумма.ID
	|			И РемонтыПГР.Регистратор = МатериальныеЗатратыСумма.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоТехОперациямСумма КАК ПоТехОперациямСумма
	|		ПО РемонтыПГР.Ремонт = ПоТехОперациямСумма.Ремонт
	|			И РемонтыПГР.ID = ПоТехОперациямСумма.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗапчастиЗатратыСумма КАК ЗапчастиЗатратыСумма
	|		ПО РемонтыПГР.ВидРемонтныхРабот = ЗапчастиЗатратыСумма.Ремонт
	|			И РемонтыПГР.ID = ЗапчастиЗатратыСумма.ID
	|			И РемонтыПГР.Регистратор = ЗапчастиЗатратыСумма.Регистратор
	|{ГДЕ
	|	(торо_ОбъектыРемонта.Приоритет = &Приоритет)}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсходныеДанныеСметы.Объект,
	|	ИсходныеДанныеСметы.ВидРемонтныхРабот,
	|	торо_ОбъектыРемонта.Приоритет,
	|	ИсходныеДанныеСметы.ДатаРемонта,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА &РасчётТрудозатрат = ""Квалификация""
	|				ТОГДА ЕСТЬNULL(ТрудозатратыСуммаПоКвалификациям.Сумма, 0)
	|			ИНАЧЕ ЕСТЬNULL(ПоТехОперациямСумма.Сумма, 0)
	|		КОНЕЦ + ЕСТЬNULL(МатериальныеЗатратыСумма.Сумма, 0) + ЕСТЬNULL(ЗапчастиЗатратыСумма.Сумма, 0) КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА &РасчётТрудозатрат = ""Квалификация""
	|				ТОГДА ТрудозатратыСуммаПоКвалификациям.Сумма
	|			ИНАЧЕ ПоТехОперациямСумма.Сумма
	|		КОНЕЦ КАК ЧИСЛО(15, 2)),
	|	МатериальныеЗатратыСумма.Сумма,
	|	ЗапчастиЗатратыСумма.Сумма,
	|	ИсходныеДанныеСметы.СпособВыполнения,
	|	ИсходныеДанныеСметы.ID,
	|	ИсходныеДанныеСметы.Смета
	|ИЗ
	|	ИсходныеДанныеСметы КАК ИсходныеДанныеСметы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ПО ИсходныеДанныеСметы.Объект = торо_ОбъектыРемонта.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТрудозатратыСуммаПоКвалификациям КАК ТрудозатратыСуммаПоКвалификациям
	|		ПО ИсходныеДанныеСметы.ID = ТрудозатратыСуммаПоКвалификациям.ID
	|			И ИсходныеДанныеСметы.Смета = ТрудозатратыСуммаПоКвалификациям.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ МатериальныеЗатратыСумма КАК МатериальныеЗатратыСумма
	|		ПО ИсходныеДанныеСметы.ID = МатериальныеЗатратыСумма.ID
	|			И ИсходныеДанныеСметы.Смета = МатериальныеЗатратыСумма.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоТехОперациямСумма КАК ПоТехОперациямСумма
	|		ПО ИсходныеДанныеСметы.ID = ПоТехОперациямСумма.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗапчастиЗатратыСумма КАК ЗапчастиЗатратыСумма
	|		ПО ИсходныеДанныеСметы.ВидРемонтныхРабот = ЗапчастиЗатратыСумма.Ремонт
	|			И ИсходныеДанныеСметы.ID = ЗапчастиЗатратыСумма.ID
	|			И ИсходныеДанныеСметы.Смета = ЗапчастиЗатратыСумма.Регистратор
	|{ГДЕ
	|	(торо_ОбъектыРемонта.Приоритет = &Приоритет)}"
		
	+ "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ЗапросТекст;
	
КонецФункции


ИспользоватьРегламентныеМероприятия = ПолучитьЗначениеФО("торо_ИспользоватьРегламентныеМероприятия");
ИспользоватьППР                     = ПолучитьЗначениеФО("торо_ИспользоватьППР");
ИспользоватьДефекты                 = ПолучитьЗначениеФО("торо_УчетВыявленныхДефектовОборудования");
ИспользоватьВнешниеОснования        = ПолучитьЗначениеФО("торо_ИспользоватьВнешниеОснованияДляРабот");
ИспользоватьСметы                   = ПолучитьЗначениеФО("торо_ИспользоватьСметыРемонта");

#КонецОбласти


#КонецЕсли
